Repository: alwynou/mira
Catalog: Apps/MiraMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: The Markdown source exceeds the 10 MiB limit.
zh_hans: Markdown 来源超过 10 MiB 限制。

source: The Markdown source is invalid.
zh_hans: Markdown 来源无效。

source: The knowledge tool context is no longer authorized.
zh_hans: 知识库工具上下文不再获得授权。

source: Enter a knowledge search query of at most 500 characters.
zh_hans: 请输入不超过 500 个字符的知识库搜索查询。

source: The knowledge source identifier is invalid.
zh_hans: 知识库来源标识符无效。

source: The knowledge source version identifier is invalid.
zh_hans: 知识库来源版本标识符无效。

source: The selected knowledge source version is unavailable.
zh_hans: 选中的知识库来源版本不可用。

source: The knowledge chunk identifier is invalid.
zh_hans: 知识库分块标识符无效。

source: The source chunk exceeds the 8 KiB limit.
zh_hans: 来源分块超过 8 KiB 限制。

source: The source chunk result exceeds the tool output limit.
zh_hans: 来源分块结果超过工具输出限制。

source: Knowledge tool arguments are invalid.
zh_hans: 知识库工具参数无效。

source: Backups contain conversations, configuration, request records, knowledge source versions and files, plus integrity checksums. API keys and other credentials are excluded. Restoring creates a separate directory and preserves the current library.
zh_hans: 备份包含对话、配置、请求记录、知识来源版本和文件，以及完整性校验和。备份不包含 API 密钥或其他凭据。恢复会创建单独的目录，并保留当前库。

source: Unreferenced managed files are eligible for cleanup after 7 days. Cleanup never removes referenced historical versions and does not rewrite existing backups.
zh_hans: 未被引用的托管文件可在 7 天后清理。清理不会删除仍被引用的历史版本，也不会改写现有备份。

source: Clean Up Unreferenced Files
zh_hans: 清理未被引用的文件

source: Cleaned up %lld unreferenced files; retained %lld referenced files.
zh_hans: 已清理 %lld 个未被引用的文件；保留 %lld 个被引用的文件。

source: This permanently removes %@, its versions and chunks, and derived source bodies. Historical body-free usage records remain. Unreferenced managed file copies may remain for at least 7 days before cleanup; existing backups are not rewritten, and the original external file is never modified.
zh_hans: 此操作会永久移除 %@、其版本和分块，以及派生的来源正文。历史无正文使用记录会保留。未被引用的托管文件副本可能至少保留 7 天后才清理；现有备份不会改写，原始外部文件也不会被修改。

source: The knowledge backup chunks do not match their source blobs.
zh_hans: 知识库备份分块与其来源数据块不匹配。

source: The staged database left an unexpected journal file.
zh_hans: 暂存数据库留下了意外的日志文件。

source: The blob storage directory is invalid.
zh_hans: 存储对象目录无效。

source: The library is busy.
zh_hans: 库正忙。

source: The library maintenance lock could not be opened.
zh_hans: 无法打开库维护锁。

source: The library maintenance lock is invalid.
zh_hans: 库维护锁无效。

source: The library maintenance lock could not be secured.
zh_hans: 无法保护库维护锁。

source: The library maintenance lock could not be acquired.
zh_hans: 无法获取库维护锁。

source: Select a Markdown file.
zh_hans: 请选择 Markdown 文件。

source: The selected Markdown file is invalid or too large.
zh_hans: 选定的 Markdown 文件无效或过大。

source: The selected Markdown file changed while it was read.
zh_hans: 选定的 Markdown 文件在读取时发生变化。

source: The selected Markdown file changed while it was opened.
zh_hans: 选定的 Markdown 文件在打开时发生变化。

source: The blob is too large.
zh_hans: 存储对象过大。

source: The existing blob does not match its digest.
zh_hans: 现有存储对象与其摘要不匹配。

source: The blob could not be synchronized.
zh_hans: 无法同步存储对象。

source: The blob directory could not be synchronized.
zh_hans: 无法同步存储对象目录。

source: The existing blob could not be opened.
zh_hans: 无法打开现有存储对象。

source: The blob could not be installed.
zh_hans: 无法安装存储对象。

source: The temporary blob could not be removed.
zh_hans: 无法移除临时存储对象。

source: The blob digest is invalid.
zh_hans: 存储对象摘要无效。

source: The blob does not exist.
zh_hans: 存储对象不存在。

source: The blob storage hierarchy is invalid.
zh_hans: 存储对象层级无效。

source: The stored blob could not be removed.
zh_hans: 无法移除已存储对象。

source: The blob storage hierarchy contains an invalid entry.
zh_hans: 存储对象层级包含无效条目。

source: The temporary blob is invalid.
zh_hans: 临时存储对象无效。

source: The blob storage directory changed while it was in use.
zh_hans: 存储对象目录在使用期间发生变化。

source: The blob storage hierarchy changed while it was in use.
zh_hans: 存储对象层级在使用期间发生变化。

source: The stored blob is invalid.
zh_hans: 已存储对象无效。

source: The stored blob does not match its digest.
zh_hans: 已存储对象与其摘要不匹配。

source: The storage path is invalid.
zh_hans: 存储路径无效。

source: The storage path is unavailable.
zh_hans: 存储路径不可用。

source: The storage path is outside the approved system directory.
zh_hans: 存储路径位于获准系统目录之外。

source: The selected Markdown file is invalid.
zh_hans: 选定的 Markdown 文件无效。

source: The storage directory could not be opened.
zh_hans: 无法打开存储目录。

source: The storage directory could not be created.
zh_hans: 无法创建存储目录。

source: The storage directory could not be synchronized.
zh_hans: 无法同步存储目录。

source: The blob storage directory could not be created.
zh_hans: 无法创建存储对象目录。

source: The blob storage directory could not be synchronized.
zh_hans: 无法同步存储对象目录。

source: The blob storage directory could not be opened.
zh_hans: 无法打开存储对象目录。

source: The blob could not be opened.
zh_hans: 无法打开存储对象。

source: The temporary blob could not be created.
zh_hans: 无法创建临时存储对象。

source: The blob storage hierarchy could not be read.
zh_hans: 无法读取存储对象层级。

source: The temporary blob could not be written.
zh_hans: 无法写入临时存储对象。

source: The blob could not be read.
zh_hans: 无法读取存储对象。

source: The stored blob is too large.
zh_hans: 已存储对象过大。

source: The blob could not be inspected.
zh_hans: 无法检查存储对象。

source: The backup file could not be written.
zh_hans: 无法写入备份文件。

source: Activate a provider and enable its models. Disabled providers keep their selections but are hidden from this pool.
zh_hans: 激活服务商并启用其模型。停用服务商会保留模型选择，但会将其从模型池中隐藏。

source: Activate the current provider configuration before fetching models.
zh_hans: 请先激活当前服务商配置，再获取模型列表。

source: Activate this provider to fetch or add models.
zh_hans: 激活此服务商后即可获取或添加模型。

source: Activation allows explicit model requests. It does not verify connectivity or enable any models automatically.
zh_hans: 激活后可主动发起模型请求。激活本身不会验证连接，也不会自动启用任何模型。

source: Add Manually
zh_hans: 手工添加

source: Add Provider
zh_hans: 添加服务商

source: Add a provider to get started.
zh_hans: 添加一个服务商以开始使用。

source: Add to Pool
zh_hans: 加入模型池

source: Adding a model to the pool does not select it for any purpose. Removing a local selection uses the workspace or global default when configured.
zh_hans: 加入模型池不会自动为任何用途选用该模型。移除当前范围的选择后，将使用已配置的工作空间或全局默认模型。

source: Capability tests send a fixed synthetic prompt without conversation history. Your provider may charge for the request.
zh_hans: 能力测试仅发送固定的合成提示词，不包含对话历史。服务商可能对此请求收费。

source: Choose Default Models
zh_hans: 选择默认模型

source: Choose a model from your pool for each purpose and scope. Background extraction requires its own explicit selection.
zh_hans: 为每个用途和范围从模型池选择模型。后台记忆提取需要单独明确选择。

source: Configure
zh_hans: 配置

source: Configure and activate a provider, select its models, then choose a model from your pool.
zh_hans: 配置并激活服务商，启用其模型，然后从模型池中选择要使用的模型。

source: Connect a Provider
zh_hans: 接入服务商

source: Custom Provider
zh_hans: 自定义服务商

source: Declare capabilities only when you have verified them. Capability observations reset when the connection, model ID, or context window changes. Adding a model does not verify its capabilities. Use Test Text and Test Tools from the model pool.
zh_hans: 仅声明你已确认的能力。连接、模型 ID 或上下文窗口变化后，能力测试记录会重置。添加模型不会验证其能力；可在模型池中执行文本和工具测试。

source: Default Models
zh_hans: 默认模型

source: Disable
zh_hans: 停用

source: Edit Provider
zh_hans: 编辑服务商

source: Fetch Models
zh_hans: 获取模型

source: Fetch the model list or add a Model ID manually, then configure the models you want to use.
zh_hans: 获取模型列表或手工添加模型 ID，然后配置要使用的模型。

source: Fetching reads only this provider’s model catalog. You can add a private deployment ID manually if discovery is unavailable.
zh_hans: 获取操作仅查询此服务商的模型目录。如果无法发现模型，可以手工添加私有部署 ID。

source: In Model Pool
zh_hans: 已加入模型池

source: Include in Model Pool
zh_hans: 加入模型池

source: Include %@ in Model Pool
zh_hans: 将 %@ 加入模型池

source: Manage Providers
zh_hans: 管理服务商

source: Maximum output tokens must be positive and smaller than the model context window.
zh_hans: 最大输出 Token 数必须为正数，且小于模型上下文窗口。

source: Model Pool
zh_hans: 模型池

source: Model discovery is unavailable in demo mode or without an open library.
zh_hans: 演示模式下或未打开资料库时无法获取模型列表。

source: Models enabled under active providers appear here and in model selectors. Configure limits and verify capabilities before sending.
zh_hans: 已激活服务商下启用的模型会显示在此处及模型选择器中。发送前请配置用量上限并确认能力。

source: New providers start inactive. After saving, activate the provider and select its models.
zh_hans: 新添加的服务商默认未激活。保存后请激活服务商并选择其模型。

source: No Models Selected
zh_hans: 尚未选择模型

source: No Models in Pool
zh_hans: 模型池为空

source: Provider
zh_hans: 服务商

source: Provider Models
zh_hans: 服务商模型

source: Provider Template
zh_hans: 服务商模板

source: Removal also deletes the related model presets and default selections. Disable the item to keep its configuration.
zh_hans: 移除还会删除关联的模型预设和默认选择。如果希望保留配置，请改为停用。

source: Remove configuration?
zh_hans: 移除配置？

source: Request usage reporting
zh_hans: 请求用量统计

source: Save Selection
zh_hans: 保存选择

source: Search models or providers
zh_hans: 搜索模型或服务商

source: The provider changed while fetching models. Fetch the list again.
zh_hans: 获取模型期间服务商配置发生了变化。请重新获取列表。

source: The provider returned no models. You can add a model manually.
zh_hans: 服务商未返回模型。你可以手工添加模型。

source: Model list loaded. Select models to add to your pool.
zh_hans: 模型列表已加载。请选择要加入模型池的模型。

source: This provider already has that model. Edit or enable the existing entry.
zh_hans: 此服务商已配置该模型。请编辑或启用现有条目。

source: Unavailable model
zh_hans: 模型不可用

source: Use Inherited Model
zh_hans: 使用继承的模型

source: Use default model
zh_hans: 使用默认模型

source: Saved Models
zh_hans: 已保存的模型

source: Available from Provider
zh_hans: 服务商提供的模型

source: Inactive
zh_hans: 未激活

source: The provider connection is disabled.
zh_hans: 服务商连接已停用。

source: The provider model is disabled.
zh_hans: 服务商模型已停用。

source: This provider connection is disabled.
zh_hans: 此服务商连接已停用。

source: Model discovery was stopped.
zh_hans: 模型列表获取已停止。

source: The provider returned an unparseable model list.
zh_hans: 服务商返回的模型列表无法解析。

source: The provider connection ended before model discovery completed.
zh_hans: 模型列表获取完成前，服务商连接已中断。

source: The provider model list exceeded its safety limits.
zh_hans: 服务商模型列表超过了安全限制。

source: The provider rejected model discovery.
zh_hans: 服务商拒绝了模型列表请求。

source: Model discovery timed out.
zh_hans: 模型列表获取超时。

source: The provider connection contents are invalid.
zh_hans: 服务商连接内容无效。

source: The model pool route must be the model's canonical route.
zh_hans: 模型池必须使用该模型的规范调用配置。

source: The canonical model pool route belongs to another model.
zh_hans: 此规范模型调用配置属于另一个模型。

source: A model with this ID is already configured for the provider connection.
zh_hans: 此服务商连接已配置相同 ID 的模型。

source: Choose an available model or use the default model before sending.
zh_hans: 发送前请选择可用模型，或改用默认模型。

source: Choose an available model from your pool.
zh_hans: 请从模型池中选择可用模型。

source: Declared
zh_hans: 已声明

source: Verified
zh_hans: 已验证

source: Test cancelled.
zh_hans: 测试已取消。

source: Agent Tools
zh_hans: Agent 工具

source: All Models
zh_hans: 全部模型

source: Applied catalog limits restrict selection and output size. Clear the reference to use manually confirmed deployment limits instead.
zh_hans: 已应用的目录限制会约束模型选择和输出大小。若部署限制不同，可清除引用后手动确认。

source: Apply Catalog Suggestions
zh_hans: 应用目录建议

source: Audio
zh_hans: 音频

source: Bundled Catalog · models.dev
zh_hans: 内置目录 · models.dev

source: Catalog declares native structured output
zh_hans: 目录声明支持原生结构化输出

source: Catalog does not declare native structured output
zh_hans: 目录未声明支持原生结构化输出

source: Catalog output limit: %@ tokens
zh_hans: 目录输出上限：%@ Token

source: Catalog retrieved: %@
zh_hans: 目录获取时间：%@

source: Catalog suggestions are declarations, not successful tests. Confirm the limits and capabilities before saving. Connection or model changes require reconfirmation.
zh_hans: 目录建议属于能力声明，不代表测试通过。保存前请确认限制和能力；连接或模型变更后需要重新确认。

source: Clear Catalog Reference
zh_hans: 清除目录引用

source: Clear the search or filter, or configure model capabilities under All Models. Only active providers contribute to the pool.
zh_hans: 请清除搜索或筛选，或在“全部模型”中配置能力。模型池仅包含已激活服务商的模型。

source: Confirm that this model supports memory extraction.
zh_hans: 请确认此模型支持记忆提取。

source: Conversation models need streaming text and valid token limits. Agent tools also need tool-call capability.
zh_hans: 对话模型需要支持流式文本，并配置有效的 Token 限制；Agent 工具还需要工具调用能力。

source: Disable thinking for DeepSeek / Kimi
zh_hans: 关闭 DeepSeek / Kimi 思考模式

source: Embedding
zh_hans: 向量嵌入

source: Filter by use
zh_hans: 按用途筛选

source: Image Generation
zh_hans: 图像生成

source: Input Modalities
zh_hans: 输入类型

source: JSON Extraction
zh_hans: JSON 提取

source: JSON extraction capability declared
zh_hans: 声明支持 JSON 提取

source: JSON extraction check did not return the requested JSON object.
zh_hans: JSON 提取测试未返回要求的 JSON 对象。

source: Manage enabled models here. Model selectors show only models ready for their purpose; use the filters to check readiness.
zh_hans: 在此管理已启用模型。选择器仅显示符合用途要求的模型，可通过筛选检查就绪状态。

source: Memory extraction needs streaming text, valid token limits, and a separate JSON extraction declaration. Native structured output is optional.
zh_hans: 记忆提取需要流式文本、有效的 Token 限制及独立的 JSON 提取能力声明；原生结构化输出是可选能力。

source: Memory extraction uses JSON text with local validation. Declare it separately or run Test JSON Extraction in the pool. Native structured output is not required.
zh_hans: 记忆提取使用 JSON 文本并在本地校验。请单独声明此能力，或在模型池中测试 JSON 提取，无需原生结构化输出。

source: Mira will request thinking disabled for this model. This option is supported only on the official DeepSeek and Kimi endpoints.
zh_hans: Mira 将请求关闭此模型的思考模式。此选项仅支持已确认的 DeepSeek 和 Kimi 官方端点及型号。

source: Model Type
zh_hans: 模型类型

source: Model information from models.dev
zh_hans: 模型资料来自 models.dev

source: Needs reasoning continuation support
zh_hans: 需要推理续接支持

source: No Matching Models
zh_hans: 没有匹配的模型

source: No catalog reference applied. Enter and confirm this deployment’s limits and capabilities manually.
zh_hans: 未应用目录引用，请手动填写并确认此部署的限制与能力。

source: No models are ready for this purpose. Configure capabilities in the model pool.
zh_hans: 暂无符合此用途的模型，请在模型池中配置能力。

source: Output Modalities
zh_hans: 输出类型

source: Reasoning continuation is not supported yet
zh_hans: 暂不支持推理续接

source: Search provider models
zh_hans: 搜索服务商模型

source: Standard text mode
zh_hans: 标准文本模式

source: Test JSON Extraction
zh_hans: 测试 JSON 提取

source: Text Generation
zh_hans: 文本生成

source: The bundled catalog supplies model information, not account access. Fetch Models checks the provider list; catalog entries may be unavailable for your account.
zh_hans: 内置目录提供模型资料，不代表账号可用权限。“获取模型”会读取服务商列表；账号可能无法使用部分目录模型。

source: The model catalog metadata does not match the configured model ID.
zh_hans: 模型目录资料与配置的模型 ID 不一致。

source: The provider catalog does not advertise a text-generation model.
zh_hans: 服务商目录未将此型号标记为文本生成模型。

source: The provider catalog does not advertise text input for this model.
zh_hans: 服务商目录未声明此模型支持文本输入。

source: The provider catalog does not advertise text output for this model.
zh_hans: 服务商目录未声明此模型支持文本输出。

source: The provider model catalog metadata is invalid.
zh_hans: 服务商模型目录资料无效。

source: The route output limit exceeds the provider catalog limit.
zh_hans: 配置的输出上限超过了服务商目录中的限制。

source: Thinking compatibility
zh_hans: 思考模式兼容性

source: Thinking-disabled mode is supported only on approved HTTPS model endpoints.
zh_hans: 关闭思考模式仅适用于已确认支持的 HTTPS 端点及模型。

source: This model needs reasoning continuation support. You can keep it in the pool, but it cannot be selected for execution yet.
zh_hans: 此模型需要推理续接支持，可以保留在模型池中，但暂时无法选择用于执行。

source: This model requires a reasoning continuation protocol that Mira does not support in standard mode.
zh_hans: 此模型需要推理续接协议，Mira 的标准模式暂不支持。

source: This model's reasoning protocol is not supported by Mira.
zh_hans: Mira 暂不支持此模型的推理协议。

source: This provider returned reasoning content that Mira cannot continue safely.
zh_hans: 服务商返回了 Mira 暂不支持续接的推理内容。

source: Enter a valid thinking token budget.
zh_hans: 请输入有效的思考 Token 预算。

source: The thinking token budget is invalid.
zh_hans: 思考 Token 预算无效。

source: A user message cannot contain a reasoning trace.
zh_hans: 用户消息不能包含模型思考记录。

source: The purged reasoning trace still contains a body.
zh_hans: 已清理的思考记录仍包含正文。

source: Thinking content changed after completion.
zh_hans: 思考内容在结束后发生了变化。

source: Thinking content ended before its continuation data was complete.
zh_hans: 思考内容已中断，续接数据不完整。

source: Thinking content exceeded the local safety limit.
zh_hans: 思考内容超过了本机大小限制。

source: The assistant transcript exceeded the local safety limit.
zh_hans: 助手记录超过了本机大小限制。

source: The assistant transcript contains invalid thinking content.
zh_hans: 助手记录包含无效的思考内容。

source: The thinking protocol does not match the provider interface.
zh_hans: 思考协议与服务商接口不匹配。

source: This model does not support the selected thinking mode.
zh_hans: 此模型不支持所选的思考模式。

source: This model does not support the selected thinking effort.
zh_hans: 此模型不支持所选的思考强度。

source: The thinking budget must be at least 1024 tokens and smaller than maximum output tokens.
zh_hans: 思考预算至少为 1024 Token，且必须小于最大输出 Token 数。

source: Maximum output tokens must leave room for both the thinking budget and the answer.
zh_hans: 最大输出 Token 数必须同时容纳思考预算和回答。

source: Completed history contains unfinished thinking content.
zh_hans: 已完成的历史记录包含未结束的思考内容。

source: Service default
zh_hans: 服务商默认

source: Enabled
zh_hans: 开启

source: Disabled
zh_hans: 关闭

source: Low
zh_hans: 低

source: Medium
zh_hans: 中

source: High
zh_hans: 高

source: Maximum
zh_hans: 最高

source: Thinking
zh_hans: 思考

source: Thinking mode
zh_hans: 思考模式

source: Thinking effort
zh_hans: 思考强度

source: Thinking interface
zh_hans: 思考接口

source: Adaptive thinking
zh_hans: 自适应思考

source: Thinking with token budget
zh_hans: 按 Token 预算思考

source: OpenAI reasoning effort
zh_hans: OpenAI 推理强度

source: OpenRouter reasoning
zh_hans: OpenRouter 推理

source: Thinking budget (tokens, optional)
zh_hans: 思考预算（Token，可选）

source: Thinking and the answer share the maximum output token limit.
zh_hans: 思考和回答共用最大输出 Token 限额。

source: This model uses thinking by default; a disable option is not available for this interface.
zh_hans: 此模型默认使用思考；此接口不提供关闭选项。

source: No answer was produced.
zh_hans: 尚未生成回答。

source: Waiting for response…
zh_hans: 等待响应…

source: The model did not provide visible thinking text.
zh_hans: 模型未提供可展示的思考文本。

source: Very high
zh_hans: 很高

source: A replay request cannot contain reasoning on a user message.
zh_hans: 重放请求中的用户消息不能包含思考内容。

source: A completed model output contains incomplete thinking content.
zh_hans: 已完成的模型输出包含未完成的思考内容。

source: Choose either thinking effort or a token budget.
zh_hans: 思考强度和思考 Token 预算只能选择一项。

source: Jump to latest
zh_hans: 回到最新内容

source: The performance fixture requires explicit demo arguments. No library was opened.
zh_hans: 性能测试实例需要明确的演示参数。未打开任何资料库。

source: The rendering benchmark requires demo mode, absolute paths, and a new fixture directory. No library was opened.
zh_hans: 渲染基准测试需要演示模式、绝对路径和新的测试目录。未打开任何资料库。

source: Background estimated cost (USD)
zh_hans: 后台费用估算（美元）

source: Cache read tokens
zh_hans: 缓存读取 Token

source: Cache write pricing requires a supported lifetime breakdown.
zh_hans: 缓存写入费用需要受支持的缓存时长明细。

source: Cache write tokens
zh_hans: 缓存写入 Token

source: Cached input USD per million tokens: %@
zh_hans: 缓存输入价格（美元／百万 Token）：%@

source: Catalog USD per million tokens · Input: %@ · Output: %@
zh_hans: 目录价格（美元／百万 Token）· 输入：%@ · 输出：%@

source: Catalog pricing does not apply to this endpoint.
zh_hans: 目录价格不适用于此接口地址。

source: Estimated cost (USD)
zh_hans: 费用估算（美元）

source: Estimates use the catalog frozen for each call. They are not the provider's bill.
zh_hans: 估算使用每次调用时冻结的价格目录，不代表服务商最终账单。

source: Foreground estimated cost (USD)
zh_hans: 前台费用估算（美元）

source: Known subtotal: %@ · Calls with unknown cost: %lld
zh_hans: 已知部分小计：%@ · 费用未知的调用：%lld 次

source: Less than %@
zh_hans: 小于 %@

source: Model call usage
zh_hans: 模型调用用量

source: No recorded calls
zh_hans: 暂无调用记录

source: No supported text pricing is saved for this model.
zh_hans: 此模型未保存可用于估算的文本价格。

source: The model pricing metadata is invalid.
zh_hans: 模型价格元数据无效。

source: The service did not report all usage needed for an estimate.
zh_hans: 服务商未报告估算所需的完整用量。

source: The service returned inconsistent usage.
zh_hans: 服务商返回的用量数据不一致。

source: Thinking tokens (included in output)
zh_hans: 思考 Token（包含在输出中）

source: This call exceeds the catalog pricing range.
zh_hans: 此次调用超出了目录价格适用范围。

source: Uncached input tokens
zh_hans: 未缓存输入 Token

source: This call has no confirmed final usage; partial counters are shown.
zh_hans: 此次调用没有确认的最终用量；当前显示的是部分计数。

source: Execution %@: related memory changed or is unavailable; the historical reply is excluded from model context.
zh_hans: 执行 %@：关联记忆已变更或不可用；历史回复已从模型上下文中排除。

source: Historical reply retained. The related memory has changed or is unavailable, so this reply is excluded from future model context.
zh_hans: 历史回复已保留。关联记忆已变更或不可用，因此该回复不再用于后续模型上下文。

source: Related memory archived
zh_hans: 关联记忆已归档

source: Related memory expired
zh_hans: 关联记忆已过期

source: Related memory forgotten
zh_hans: 关联记忆已遗忘

source: Related memory not yet valid
zh_hans: 关联记忆尚未生效

source: Related memory pending review
zh_hans: 关联记忆待审核

source: Related memory rejected
zh_hans: 关联记忆已拒绝

source: Related memory removed
zh_hans: 关联记忆已移除

source: Related memory superseded
zh_hans: 关联记忆已被替代

source: Related memory unavailable
zh_hans: 关联记忆不可用

source: Related memory updated
zh_hans: 关联记忆已更新

source: The memory history execution is unavailable.
zh_hans: 关联记忆的历史执行不可用。

source: Automatic memory is off
zh_hans: 自动记忆已关闭

source: Ordinary statements are not saved automatically. Enable automatic memory and choose a dedicated extraction route in Settings.
zh_hans: 普通陈述不会自动保存。请在“设置”中启用自动记忆，并选择专用的提取路由。

source: No candidate extraction yet
zh_hans: 尚未进行候选提取

source: After your next completed conversation, eligible memories will be extracted as candidates for your review. They will not enter recall automatically.
zh_hans: 完成下一次对话后，符合条件的记忆会被提取为候选内容供您审核。它们不会自动进入召回。

source: No automatic capture yet
zh_hans: 尚未进行自动捕获

source: After your next completed conversation, eligible memories may be saved automatically. You can undo, edit, archive, or forget them.
zh_hans: 完成下一次对话后，符合条件的记忆可能会自动保存。您可以撤销、编辑、归档或遗忘这些记忆。

source: Open memory settings
zh_hans: 打开记忆设置

source: Capture mode: %@
zh_hans: 捕获模式：%@

source: Automatic capture is off. Existing extraction jobs remain available below; ordinary statements are not saved automatically.
zh_hans: 自动捕获已关闭。现有提取任务仍会显示在下方；普通陈述不会自动保存。

source: Candidate capture is enabled. New eligible memories will wait for your review.
zh_hans: 候选捕获已启用。新的符合条件的记忆会等待您审核。

source: Automatic capture is enabled. Eligible memories may be saved with undo controls.
zh_hans: 自动捕获已启用。符合条件的记忆可能会保存，并提供撤销控制。

source: System instructions
zh_hans: 系统指令

source: Request order
zh_hans: 请求顺序

source: System instructions are applied first. Message entries below remain in their recorded order. JSON object key order does not represent prompt order.
zh_hans: 系统指令最先应用。下方消息按记录中的顺序显示。JSON 对象字段顺序不代表提示词顺序。

source: Canonical request JSON
zh_hans: 规范请求 JSON

source: Retrieved context
zh_hans: 检索到的上下文

source: User message
zh_hans: 用户消息

source: Assistant message
zh_hans: 助手消息

source: Tool result
zh_hans: 工具结果

source: Tool definitions
zh_hans: 工具定义

source: A replay request can contain reasoning only on an assistant message.
zh_hans: 重放请求只能在助手消息中包含推理内容。

source: Retrieved context must be one data-only message immediately before the current user message.
zh_hans: 检索上下文只能有一条纯数据消息，且必须紧接在当前用户消息之前。

source: Accept
zh_hans: 接受
